<template>
    <transition name="slider">
        <div class="reg-agreement">
            <p>
                甲乙双方经协商一致，依据《中华人民共和国合同法》及相关法律法规的规定，本着自愿、平等、诚实信用的原则,就运输业务信息达成如下协议；
            </p>
            <h3>
                一、合作内容
            </h3>
            <p>
                1. &nbsp;“小黑师傅”物流运输APP通过其“小黑师傅”物流运输叫车系统（以下简称“司机端”）发布用户的危险品运输服务订单，物流服务商/司机通过司机端进行订单的确认、查询等操作，并在承接订单后向用户提供货物运输服务。
            </p>
            <p>
                2. &nbsp;物流服务商/司机于司机端注册的账号所有权归属“小黑师傅”，在本协议合作期限内对司机端账号享有使用权，物流服务商/司机应妥善保管司机端账号及密码并定期更换密码，通过司机端账号进行的任何操作均视为物流服务商/司机的自主操作，由此产生的后果全部由物流服务商/司机承担。
            </p>
            <h3>
                二、权利和义务
            </h3>
            <p>
                1. &nbsp;物流服务商/司机需根据司机端产品/服务规则及“小黑师傅”的要求向“小黑师傅”提供身份证、驾驶证、行驶证、车架号、人员保险、危化品运输资质等证明文件及其他相关证明，物流服务商/司机保证向“小黑师傅”提供的上述证明文件或其他相关证明真实、合法、准确、有效，否则“小黑师傅”有权终止本协议，造成“小黑师傅”损失的，物流服务商/司机应承担赔偿责任。
            </p>
            <p>
                2. &nbsp;物流服务商/司机承诺并保证其通过各种方式向“小黑师傅”提供的所有信息（包括但不限于个人身份信息、图片、工作经验及基础技能信息等）真实、准确、合法，不违反国家有关法律法规的规定，不损害“小黑师傅”品牌利益及第三方的合法权益，并授权“小黑师傅”、“小黑师傅”关联公司及合作方以任何形式无偿使用上述信息。由于物流服务商/司机提供信息不准确或更新不及时所产生的相关损失均由物流服务商/司机承担。
            </p>
            <p>
                3. &nbsp;物流服务商/司机应对其向经由“小黑师傅”、“小黑师傅”关联公司及合作方平台下达订单（以下简称“订单”）的用户（以下简称“用户”）提供运输服务的行为承担完全责任，包括物流服务商/司机在提供服务过程中造成的第三方（含下达订单的用户）人身、财产损害的责任承担和由此导致的相关纠纷的及时妥善处理；如因物流服务商/司机原因造成“小黑师傅”被第三方主张权利、要求赔偿或发生诉讼及相关纠纷的，物流服务商/司机应向“小黑师傅”全额赔偿由此给小黑师傅造成的损失（包括但不限于小黑师傅为提升用户体验进行先行赔偿或者先行处理所支出的费用），并采取有效措施降低对小黑师傅的不利影响。
            </p>
            <p>
                4. &nbsp;物流服务商/司机向小黑师傅用户提供运输服务时，未经小黑师傅书面许可，物流服务商/司机不得擅自以小黑师傅的名义进行许诺或者代其他第三方（特别是与小黑师傅服务构成竞争关系的组织及个人）进行宣传、许诺；物流服务商/司机提供运输服务过程中，应积极维护小黑师傅的企业形象及品牌利益，提升经由小黑师傅获得的订单用户体验及积极维护小黑师傅的商业信誉；物流服务商/司机不得进行或协助协议以外的第三方对小黑师傅进行任何形式的诋毁或污蔑。物流服务商/司机存在上述行为的，小黑师傅有权单方通知物流服务商/司机终止服务并解除本协议，同时小黑师傅有权要求物流服务商/司机承担由此导致的损失，损失无法计算的，应以不低于500,000元人民币计算。
            </p>
            <p>
                5. &nbsp;小黑师傅有权对物流服务商/司机向小黑师傅提供的所有信息及物流服务商/司机在履行本协议期间产生的所有订单信息、实际操作信息、订单用户的评价反馈信息等以合理方式保存、备份、管理，并有权在本协议终止后继续保留并免费使用。
            </p>
            <p>
                6. &nbsp;为了更有效的推销物流服务商/司机的运输服务，物流服务商/司机授权小黑师傅可自主决定通过自身或其他渠道，包括但不限于线下推广活动、委托第三方等多种渠道，开展运输预订业务，为物流服务商/司机销售运输服务。
            </p>
            <p>
                7. &nbsp;小黑师傅作为专业的运输预订服务提供商，将致力于为物流服务商/司机提供全方位的运输预订销售服务并为物流服务商/司机进行相应的市场推广，但小黑师傅保留随时停止推广的权利。
            </p>
            <p>
                8. &nbsp;物流服务商/司机保证并承诺向小黑师傅用户提供服务过程中，不与小黑师傅构成竞争关系的平台/中介信息服务的第三方互联网及软件服务平台、实体公司和其他相关组织机构下从事同类或者相似的服务。
            </p>
            <h3 style="margin-bottom: 10px;">
                三、费用及结算
            </h3>
            <h4>
                (一)&nbsp;结算
            </h4>
            <p>
                合作期间内，小黑师傅享有用户支付、物流服务商/司机收款的代收代付职责与权利，按照司机端内规则和日期说明为物流服务商/司机进行结算付款。小黑师傅应按照本协议或补充协议约定的费用标准、时间、方式向物流服务商/司机收取其运输服务费一定比例的信息技术服务费，并有权随时调整信息技术服务费收取比例。
            </p>
            <h4>
                (二)&nbsp;货物保障
            </h4>
            <p>
                物流服务商/司机和小黑师傅一致同意，为了保障货物的安全运输，物流服务商/司机应对订单内标注货物提供详尽的安全保障方案和承担订单内运输/货品安全的所有相关责任。物流服务商/司机在运输过程中，若出现了涉及货物赔付的事件，物流服务商/司机应2个工作日内与用户联系协商处理方案，小黑师傅会提供相关证明协助理赔事件进行鉴定；
            </p>
            <h4>
                (三)&nbsp;保证金
            </h4>
            <p>
                1.&nbsp;保证金缴纳<br>
                合作期间内，物流服务商/司机应向小黑师傅缴纳一定金额的保证金（以实际缴纳的保证金金额和司机端显示金额为准），作为履行本协议的保证。物流服务商/司机在提供服务过程中，如违反本协议正文、补充协议及司机端产品/服务规则的（包含但不限于：接单后12小时内未与用户响应、接单未处理、约定时间车辆未抵达等），小黑师傅有权根据相关约定扣除相应金额的保证金作为违约金或给予小黑师傅运输服务购买方等相关方的赔偿/ 补偿金或缴纳给相关部门的罚款等。如该损失通过上述方式仍无法弥补，则小黑师傅有权单方终止服务、关闭司机端账号，且有权继续向物流服务商/司机追偿。
            </p>
            <p>
                2.&nbsp;保证金的管理和使用<br>在下述情形下，小黑师傅有权直接扣除部分或全部保证金；物流服务商/司机应缴保证金不足额的，物流服务商/司机应限期补足或由小黑师傅直接在其代收服务款项中足额补足。<br> 
                (1) &nbsp;物流服务商/司机违反本协议或本条款项下的任何保证、承诺或义务的；<br>
                (2) &nbsp;物流服务商/司机在提供服务信息、达成交易、履行交易相关活动中，违反法律、法规、司机端产品/服务的任何规则或违反其对用户的承诺，或被用户投诉、索赔时，物流服务商/司机根据自身的判断对用户进行赔付的；<br>
                (3) &nbsp;物流服务商/司机违反本协议、物流服务商/司机与小黑师傅或小黑师傅关联公司的其他协议或司机端产品/服务的任何规则，给小黑师傅、小黑师傅关联公司造成任何损失的。
            </p>
            <p>
                3.&nbsp;保证金的退还<br>
                本协议终止且物流服务商/司机基于本协议产生的所有订单终止、所有索赔完结，物流服务商/司机可向小黑师傅提交退还保证金的电子申请，小黑师傅审核通过后7个工作日内，扣除依据本协议正文、附件及司机端产品/服务规则等应扣除金额后，将保证金余额无息退还物流服务商/司机，如物流服务商/司机支付的保证金不足以抵扣应由物流服务商/司机支付的违约金、赔偿金等款项的，小黑师傅将不予退还物流服务商/司机保证金，并保留向物流服务商/司机追偿的权利。
            </p>
            <h3>
                四、协议变更与解除
            </h3>
            <p>
                1. &nbsp;小黑师傅有权随时对司机端产品/服务规则进行必要的修改，物流服务商/司机应定期登录司机端相关页面，了解最新的规则内容。变更后的规则在司机端相关页面公布后七天，将自动生效。如物流服务商/司机不同意相关变更，应当立即停止使用司机端，并停止接受小黑师傅所提供的信息技术服务。如物流服务商/司机在规则变更7日后继续使用司机端及小黑师傅运输服务的，即表示物流服务商/司机接受已修订的司机端产品/服务规则。
            </p>
            <p>
                2. &nbsp;物流服务商/司机单方提出终止本协议的，需提前7天通知小黑师傅，并告知小黑师傅意向解约日；截止至意向解约日的服务期内，物流服务商/司机应当保证将物流服务商/司机注册账户下所属未处理完毕的订单及相关事宜（包括但不限于待接订单、待服务订单改派、周期订单改派、已服务订单的结算报单）处理完毕。物流服务商/司机向小黑师傅提交解约申请，经双方确认相关权利义务履行无异议后，双方签订电子《终止协议》。
            </p>
            <p>
                3. &nbsp;物流服务商/司机无故停止服务之日起7日内未向小黑师傅申请解约并签订电子《终止协议》的，小黑师傅不予退还物流服务商/司机已缴纳的保证金。
            </p>
            <h3>
                五、违约责任及免责事由
            </h3>
            <p>
                1. 物流服务商/司机向订单用户提供运输服务的过程中，不得出现下列行为，否则小黑师傅有权立即终止本协议，关闭物流服务商/司机账号，并有权在要求物流服务商/司机赔偿物料损耗费、培训费及相关费用损失且不予退还保证金的基础上，要求物流服务商/司机承担违约金不低于100,000元的其他相关损失（包括但不限于商誉损失）及承担相关法律责任：<br>
                (1) &nbsp;盗窃行为、因故意或重大过失对他人造成人身损害及财产损害的行为、违反相关服务行业操作规范及其他违反法律法规相关规定及社会公序良俗的行为；<br>
                (2) &nbsp;通过任何手段、以任何方式自行或者委托他人进行虚拟交易、虚拟验证、自买自卖、伪造网络用户真实消费/体验的行为；通过任何手段、以任何方式自行或者委托他人从事作弊、刷单、伪造、仿冒等违背本协议合作目的或违反法律法规的不实行为；<br>
                (3) &nbsp;向协议以外的第三方泄露小黑师傅的商业机密，包括但不限于产品规则及政策、交易流水、订单运营数据、服务标准化培训信息及产品/服务规则等小黑师傅的敏感及专有信息；<br>
                (4) &nbsp;擅自将经由小黑师傅获得的订单服务信息转让、倒卖、赠与、分享或以任何方式提供给协议以外的第三方；<br>
                (5) &nbsp;未经小黑师傅书面同意，私设运输服务收费项目，例如上门费、提货等待费、延时附加费等，小黑师傅以书面形式或者司机端操作模式默认的除外；<br>
                (6) &nbsp;不按小黑师傅订单提示的运输服务信息提供服务，且未及时通知小黑师傅运输预订服务负责人及客服系统，从而影响其及时作出合理的消除不良影响的安排；上述行为包括但不限于恶意拒单、接单后无故恶意甩单、无正当理由不接听小黑师傅订单用户的电话等其他给用户造成不良体验的行为；<br>
                (7) &nbsp;其他损害小黑师傅、小黑师傅关联公司及合作方利益和/或损害小黑师傅订单用户的利益和/或违反本协议或小黑师傅司机端不时发布的各项规则和/或违反法律法规规定、社会公序良俗的行为。
            </p>
            <p>
                2.如物流服务商/司机违反本协议约定，则小黑师傅有权根据其行为造成后果的严重程度，采取如下措施：<br>
                (1) &nbsp;要求物流服务商/司机按照小黑师傅要求立即修改相关信息、或立即纠正相关违约行为；<br>
                (2) &nbsp;要求物流服务商/司机到小黑师傅指定地点进行服务培训；<br>
                (3) &nbsp;中止为物流服务商/司机提供服务；<br>
                (4) &nbsp;终止为物流服务商/司机提供服务，并关闭账号；<br>
                (5) &nbsp;扣除保证金；<br>
                (6) &nbsp;要求物流服务商/司机承担赔偿损失等其他责任。
            </p>
            <p>
                3. &nbsp;因战争、自然灾害、政府行政行为、互联网不法攻击、第三方互联网通讯供应商原因、小黑师傅操作平台及软件原因、网站服务器、数据库系统维护及系统升级而导致小黑师傅服务器不能正常接入或临时性障碍无法履行本合同约定之义务时，不视为小黑师傅违约，但小黑师傅应尽力将上述时间及由此给物流服务商/司机导致的不便及损失控制在最短时间及最小范围内。
            </p>
            <h3>六、其他条款</h3>
            <p>
                1. &nbsp;除本协议另有约定外，未经另一方事先书面同意，一方在任何情况下不得以任何方式向任何第三方披露或泄漏、提供其基于本协议从另一方获得的关于另一方的任何保密信息，并且未经另一方的事先书面同意，一方也不得因非基于履行本协议的目的而使用该等保密信息；但小黑师傅将本条约定的保密信息披露给为了履行工作和职责而需要知道该种保密信息的雇员、管理人员、董事、代理商和/或顾问以及小黑师傅的关联公司则不视为对本条的违反。本保密条款有效期为合同履行完毕或解除/终止后两年。
            </p>
            <p>
                2. &nbsp;不论本协议是否另有规定，物流服务商/司机认可并同意，小黑师傅有权根据业务发展需要将其在本协议项下的权利及/或义务部分或全部转让给第三方。除此以外，未经另一方事先书面同意，任何一方不得全部或部分转让本协议项下的权利或义务。
            </p>
            <p>
                3. &nbsp;双方均不得在签约过程中，为获得交易机会或有利的交易条件而向对方任何人员（包括其员工、家属、朋友或有直接或间接关系人士）提供金钱的、实物的或其他任何形式的贿赂、回扣。
            </p>
            <p>
                4. &nbsp;本协议未尽事宜，双方可另行协商签订书面补充协议。本协议附件、补充协议、乙方在司机端公布的产品/服务规则等是本协议的有效组成部分，与本协议具有同等法律效力。
            </p>
            <p>
                5. &nbsp;因本协议引起的任何争议和纠纷，应由双方协商解决。协商不能解决的，任何一方均可向合同签订地人民法院提起诉讼，本协议签订地为北京市朝阳区。
            </p>
            <p>
                6. &nbsp;本协议一式叁份，自双方签字盖章之日起生效，甲方持有壹份，乙方持有贰份，每份具有同等法律效力。
            </p>
        </div>
    </transition>
</template>
<script>
export default {
    data() {
        return {

        }
    },
    created() {
        document.title = '小黑师傅运输服务协议';
    },
    methods: {
        
    }
}
</script>
<style lang="scss">
    .reg-agreement{
        background-color: #fff;
        width: 94%;
        margin: 0 auto;
        padding: 20px 0;
        p{
            line-height: 20px;
            margin: 6px 0;
        }
        h3{
            font-weight: 700;
            height: 20px;
            line-height: 20px;
        }
        h4{
            height: 20px;
            line-height: 20px;
        }
    }
    .slider-enter, .slider-leave-to{
        transform: translate3d(100%, 0, 0);
    }
    .slider-enter-active, .slider-leave-active{
        transition: all 0.2s;
    }
</style>