<template>
    <transition name="slider">
        <div class="reg-agreement">
            <p>
                本协议适用于小黑师傅危化品运输服务项目（以下简称“小黑师傅”），用户（指有货物 运输需求并通过“小黑师傅”应用程序软件（以下简称“小黑师傅app”）或通过其他app、网站下达服务订单的使用者）访问、浏览或使用小黑师傅app或其他可下达服务订单的app、网站即视为用户了解并认可本协议及小黑师傅有关用户的最新政策。
            </p>
            <p>
                用户可通过小黑师傅app或通过其他可下达服务订单的app、网站 选择平台司机并接受其所提供的危化品运输服务，用户应依据收费标准和用户政策向平台司机支付服务费用。用户知晓并认可，服务费价格为用户方所提供，上述服务费价格为不含税价格。
            </p>
            <p>
                用户须根据小黑师傅提供的信息核实平台司机身份和车辆信息，如因未经核实使用了非平台的司机，因此产生的纠纷或损失，小黑师傅不承担责任。用户理解并同意：小黑师傅是一家提供免费信息服务的平台，用户通过小黑师傅信息服务 平台提供的信息付款获得的服务均系第三方提供，相应地，用户有权向您付款的服务提供方索要发票。
            </p>
            <p>
                用户在平台司机向其提供危化品运输服务前，须与平台司机确认委托运输货物本身情况、接货位置及运输时间；货物装车后，平台司机须按照用户要求的路线行驶，但如按照此路线行驶确有困难（包括但不限于路况不佳、前方事故等）， 平台司机可与用户协商变更线路。如协商不成，则因用户坚持原定路线、且非因平台司机过错而在行驶途中的发生全部损失应由用户自行承担，小黑师傅对此不承担任何责任；对于跟车用户提出的违章驾驶要求，平台司机有权拒绝，如因跟车用户的原因造成任何交通事故或人身损失（包括平台司机、跟车用户自身或任何第三方），小黑师傅不承担责任与赔偿义务，由用户自行承担，因此对小黑师傅或平台司机造成损失，用户应承担全部赔偿责任）。
            </p>
            <p>
                任何违反国家法律法规的货物不属于小黑师傅业务项下平台司机的托运范围，如用户隐瞒与托运物品相关的信息或强制进行托运，因此导致的托运货物泄漏、污染、爆炸、凝固、遗失等，以及因此给用户自身或平台司机或任何第三方造成的任何损失等，均由用户自行承担，平台司机和小黑师傅均不承担任何责任。
            </p>
            <p>
                因不可抗力因素造成的货物在途运输损失及交通事故，小黑师傅不承担任何责任。为免疑义，本协议项下的“不可抗力因素”是指本协议各方不能控制、不能预见或即使预见亦无法避免的事件，该事件足以妨碍、影响或延误任何一方根据本协议履行其全部或部分义务。该事件不限于自然灾害、战争、政策变化、交通管制等政府行为、计算机病毒攻击、黑客入侵或电信机构服务中断造成的事件。
            </p>
            <p>
                到达指定送达地点后，用户须立即与平台司机确认卸货时间与卸货位置，在司机完成卸货并上传卸货单据后，用户需立即确认运输货物（用户拒绝确认或无正当理由拖延时间未予确认的，视为用户已确认），用户确认之后服务结束。结束服务后出现或声称运输物品货损的，小黑师傅及平台司机均不承担任何责任。
            </p>
            <p>
                用户未通过小黑师傅官方预约渠道进行预约，即私下预约小黑师傅的平台司机提供服务的，不视为接受了本协议项下的服务。因此产生的任何法律责任和经济损失均由用户自行承担，小黑师傅不承担任何责任。
            </p>
            <p>
                第三方支付机构向小黑师傅提供资金托管服务，用户在小黑师傅支付的款项均由第三方支付机构管存。用户理解并同意，由于第三方支付机构或提供的资金托管服务原因导致的一切用户损失，小黑师傅不承担任何责任。
            </p>
            <p>
                本协议在用户访问、浏览或使用小黑师傅app时生效。本协议在【北京市朝阳区】签订。
            </p>
            <p>
                温馨提示：如您遇到（1)交通事故、（2)财物失窃或（3)人身伤害等情况建议您及时拨打122或110进行报警。
            </p>
            <p>
                小黑师傅保留随时修改或替换本协议条款，或者更改、暂停或中断服务或应用程序（包括但不限于任何功能、数据库和内容的可用性），或将小黑师傅在本协议项下的杈利及/或义务全部或部分转让给第三方的杈利。届时，小黑师傅仅需在其网站及/或小黑师傅app上发布通告。用户如不同意小黑师傅对本协议所作的修改，有杈随时停止使用小黑师傅app。如用户继续使用小黑师傅app，视为同意小黑师傅对本协议所作的修改。
            </p>
            <p>
                本协议适用中国法律。关于本协议的违约、终止、履行、解释或因小黑师傅 app的使用所产生的或与此相关的任何争议，由本协议签订地所属人民法院管辖。
            </p>
        </div>
    </transition>
</template>
<script>
export default {
    data() {
        return {

        }
    },
    created() {
        document.title = '小黑师傅用户端注册协议';
    },
    methods: {
        
    }
}
</script>
<style lang="scss">
    .reg-agreement{
        background-color: #fff;
        width: 94%;
        margin: 0 auto;
        padding: 20px 0;
        p{
            line-height: 20px;
            text-indent: 16px;
            margin: 6 0px;
        }
    }
    .slider-enter, .slider-leave-to{
        transform: translate3d(100%, 0, 0);
    }
    .slider-enter-active, .slider-leave-active{
        transition: all 0.2s;
    }
</style>